---
kind: type
id: T:Autodesk.Revit.DB.Events.DocumentSavingEventArgs
source: html/e812523c-81f5-454f-9868-4332ab6c74a9.htm
---
# Autodesk.Revit.DB.Events.DocumentSavingEventArgs

The event arguments used by the DocumentSaving event.

## Syntax (C#)
```csharp
public class DocumentSavingEventArgs : RevitAPIPreDocEventArgs
```